<?php

/**
 * ===============================================
 * PHPCAN微服务框架 - docker版本
 * ===============================================
 * 版本：PHP7.0 +
 * 作者: suruibuas / 317953536@qq.com
 * 日期: 2018/1/24 13:39
 * 官网：http://www.phpcan.cn
 * ===============================================
 * PHPCAN入口文件，请不要做任何改动
 * ===============================================
 */

if(version_compare(PHP_VERSION,'7.0.0','<')){
    exit('PHP版本必须大于7.0');
}
// 项目根目录，项目所有涉及到目录的地方以此作为根目录
define('ROOTPATH', dirname(__FILE__));
// 引入驱动文件
require ROOTPATH . '/phpcan/Driver.php';